In [1]:
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt

import sys
sys.path.insert(1, '../src/')
from titanic import *

/home/ian/anaconda3/lib/python3.7/site-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
# importing data sets from kernel 

train = pd.read_csv('../data/raw/train.csv')
test = pd.read_csv('../data/raw/test.csv')
print('     In Training Set:')
identify_blanks(train)
print('     In Test Set:')
identify_blanks(test)
train.head()

     In Training Set:
column PassengerId has 0 missing values.  0%
column Survived has 0 missing values.  0%
column Pclass has 0 missing values.  0%
column Name has 0 missing values.  0%
column Sex has 0 missing values.  0%
column Age has 177 missing values.  19%
column SibSp has 0 missing values.  0%
column Parch has 0 missing values.  0%
column Ticket has 0 missing values.  0%
column Fare has 0 missing values.  0%
column Cabin has 687 missing values.  77%
column Embarked has 2 missing values.  0%
     In Test Set:
column PassengerId has 0 missing values.  0%
column Pclass has 0 missing values.  0%
column Name has 0 missing values.  0%
column Sex has 0 missing values.  0%
column Age has 86 missing values.  20%
column SibSp has 0 missing values.  0%
column Parch has 0 missing values.  0%
column Ticket has 0 missing values.  0%
column Fare has 1 missing values.  0%
column Cabin has 327 missing values.  78%
column Embarked has 0 missing values.  0%

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Fill missing data

In [3]:
df = one_hot_age_gender(train)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Boy,Girl,Man,Woman
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,0,0,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,0,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1,0

In [4]:
m = len(df.loc[df['Man'] == 1])
w = len(df.loc[df['Woman'] == 1])
b = len(df.loc[df['Boy'] == 1])
g = len(df.loc[df['Girl'] == 1])
tot = m + w + b + g
print(f'Total Men:   {m}')
print(f'Total Woman: {w}')
print(f'Total Men:   {b}')
print(f'Total Woman: {g}')
print(f'All Records: {tot}')
len(df)

Total Men:   533
Total Woman: 235
Total Men:   44
Total Woman: 79
All Records: 891

891

In [5]:
df = split_cabin(df)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Boy,Girl,Man,Woman,Cabin Prefix,Cabin Number
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1,0,NaN,<NA>
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,0,0,1,C,85
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,0,1,NaN,<NA>
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,0,0,1,C,123
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1,0,NaN,<NA>

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 18 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   891 non-null    int64
 1   Survived      891 non-null    int64
 2   Pclass        891 non-null    int64
 3   Name          891 non-null    object
 4   Sex           891 non-null    object
 5   Age           714 non-null    float64
 6   SibSp         891 non-null    int64
 7   Parch         891 non-null    int64
 8   Ticket        891 non-null    object
 9   Fare          891 non-null    float64
 10  Cabin         204 non-null    object
 11  Embarked      889 non-null    object
 12  Boy           891 non-null    int64
 13  Girl          891 non-null    int64
 14  Man           891 non-null    int64
 15  Woman         891 non-null    int64
 16  Cabin Prefix  204 non-null    object
 17  Cabin Number  200 non-null    Int64
dtypes: Int64(1), float64(2), int64(9), object(6)
memory usage: 126.3+ KB

In [7]:
df = append_one_hot(df, 'Embarked')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Embarked,Boy,Girl,Man,Woman,Cabin Prefix,Cabin Number,"(Embarked C,)","(Embarked Q,)","(Embarked S,)"
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,S,0,0,1,0,NaN,<NA>,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,C,0,0,0,1,C,85,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,S,0,0,0,1,NaN,<NA>,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,S,0,0,0,1,C,123,0,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,S,0,0,1,0,NaN,<NA>,0,0,1

In [8]:
df.columns

Index([  'PassengerId',      'Survived',        'Pclass',          'Name',
                 'Sex',           'Age',         'SibSp',         'Parch',
              'Ticket',          'Fare',         'Cabin',      'Embarked',
                 'Boy',          'Girl',           'Man',         'Woman',
        'Cabin Prefix',  'Cabin Number', ('Embarked C',), ('Embarked Q',),
       ('Embarked S',)],
      dtype='object')